{    
	"Rainy_Day_0": "Be careful out there, sweatheart. It's raining buckets today.#$e#Rainy days are the only time I'm glad I have chores to do.$h",
    "Rainy_Day_1": "I made you some warm soup to make sure you won't get cold out there.[199 219 236 456 457]",
    "Rainy_Day_2": "Try to stay dry, dear. I don't want you to come back home completely drenched.",
    "Rainy_Day_3": "I appreciate that mother nature decided to water our plants today. I'll make sure to repay the favor soon.",
    "Rainy_Day_4": "I hope Sam and Vincent are staying dry today.#$e#I don't want them to catch a cold.",
    "patio_Jodi": "It's refreshing to see someone else do all the work for once.$h",
    "Rainy_Night_0": "It's good to finally see you home.#$e#Cuddling under a big warm blanket is the best way for a rainy day to end.",
    "Rainy_Night_1": "It was lovely to spend time with %pet today.#$e#They're an adorable animal.",
    "Rainy_Night_2": "I hope you cleaned your boots at the door. I don't want mud and water all over the clean floor.$6",
    "Rainy_Night_3": "I made you something to warm you up after today, honey. Drink it before it gets cold.[395 253 614]",
    "Rainy_Night_4": "The sound of rain is so soothing. I'll easily fall asleep tonight.",
    "Indoor_Day_0": "I love all the fresh crops and fish you bring home.#$e#They're tastier and healthier than anything I used to buy.",
    "Indoor_Day_1": "Good morning, sweetheart! I made pancakes for breakfast, here you go.[211]#$e#Pancakes are my favourite.",
    "Indoor_Day_2": "I'll make sure the house will be completely clean when you return.#$e#It's the least I can do for you.",
    "Indoor_Day_3": "I think I'll relax and finally watch my recordings of The Queen of Sauce. I never had the time to watch them.#$e#I'm sure I'll find something tasty in there for us.",
    "Indoor_Day_4": "Good morning, dear. Did you sleep okay? We have a long day ahead of us.",
    "Indoor_Night_0": "It's a lovely evening on the farm today, @#$e#I love listening to the sounds of nature this late.",
    "Indoor_Night_1": "Welcome home, sweetheart. I cooked dinner for us while you were away.[231 198 200 205 214]",
    "Indoor_Night_2": "It still feels a bit weird not having to do chores the entire day.#$e#I'm not complaining about it though.",
    "Indoor_Night_3": "I'm ready to go to bed whenever you are, dear.",
    "Indoor_Night_4": "Vincent sent me a letter today telling me about what he's been doing recently.#$e#I'm happy that my boys are alright on their own.",
    "Outdoor_0": "I'm glad that I can finally take the time to appreciate the beatuiful scenery of this place.",
    "Outdoor_1": "The air is so fresh out here and it's filled with the scents of nature.",
    "Outdoor_2": "Make sure to take a break or grab a snack if you need one.",
    "Outdoor_3": "The wildlife around here seems to be just as busy as me before our marriage.#$e#I hope they can take a break soon.",
    "Outdoor_4": "You have to stop and apreciate the small things in life every now and then. It's easy to forget that.",
    "funLeave_Jodi": "I'll visit Caroline today.#$e#I can't wait to catch up on everything I've missed in town$h",
    "funReturn_Jodi": "How was your day dear? Mine was great, catching up with Caroline was fun.",
	"OneKid_0": "I can't believe I'm a mother of three now.#$b#Though life has been pretty suprising since you moved here in general.$h",
	"OneKid_1": "Have you played with %kid1 yet? They grow up quicker than you think.",
	"OneKid_2": "I'll use my experience as a mom to help you raise %kid1. I know how overwhelming it can be to be a fresh parent.",
    "TwoKids_0": "Parenthood surely isn't the easiest journey but it's definitely worth it.",
    "TwoKids_1": "Perhaps I could ask Sam to babysit %kid1 and %kid2 for us sometime.",
    "Good_0": "You're looking quite handsome today.",
    "Good_1": "I'm so glad I decided to marry you, @.",
    "Good_2": "I never thought someone would be willing to marry me after already being married and having two children.#$e#Thanks for proving me wrong.$l",
    "Good_3": "Be careful out there, honey. I don't want you collapsing somewhere out there.",
    "Good_4": "I sometimes wonder whether destiny brought us together. Before you moved here I never thought I'd have a second chance at marriage.",
    "Neutral_0": "Say hi to my boys for me if you run into them, okay?",
    "Neutral_1": "I'm feeling lazy today. I think I'll relax and do nothing for once.",
    "Bad_0": "Maybe this marriage isn't that much better than my old one after all.$s",
    "Bad_1": "Do you still love me? I don't feel that spark between us anymore...$s",
	"Rainy_Day_Jodi": "Watch out for slippery mud out there, sweetheart. Trust me, washing mud off of your clothes and yourself is not fun.",
	"Rainy_Night_Jodi": "Welcome home, dear. I hope you managed to get everything done despite the rain today.",
	"Indoor_Day_Jodi": "The gentle warmth of the sun is really energizing.#$e#Watch out world, here I come!",
	"Indoor_Night_Jodi": "You look tired, @.#$e#Should I perhaps read you a bedtime story?$h",
	"Outdoor_Jodi": "I love our farm, dear. I appreciate all the hard work you put into it.",
	"spring_Jodi": "I'm ready to tackle the new year together with you, honey.",
	"summer_Jodi": "I love summer but I don't look forward to how much I'll be sweating while working in this heat.",
	"fall_Jodi": "The colours of fall are beautiful.#$e#Not as beautiful as you of course.$h",
	"winter_Jodi": "I love the snow, there's always plenty of it here.#$e#How about we build a snowman, @?",
	"spouseRoom_Jodi": "#$c .5#Maybe I'll work out a bit on my own today.#$e#Sometimes I just like sitting down and reflecting on life.",
	"spring_9": "Tomorrow is Vincent's birthday. I hope you have a gift for him.#$e#Oh, they grow up so fast.$h",
	"spring_14": "Have you collected any spring onions this spring yet?#$e#Vincent knows a lot about them. If only he was as good in his other subjects too.",
	"summer_16": "It's Sam's birthday tomorrow.#$e#Oh they grow up so fast. I can't believe he's an adult already.",
	"summer 23": "I made some ice cream this morning, dear. I love frozen treats in the summer.[233]#$e#Make sure to eat it before it melts.$h",
	"summer_4": "I'm tempted to have some fun with one of the sprinklers.$h#$e#But I don't want to trample any of your crops on accident.",
	"fall_3": "I look forward to making a pumpkin pie with one of our self-grown pumpkins.#$e#Or maybe I should make a blackberry cobbler.",
	"fall_21": "I could gather some of these leaves and make a cozy pile out of them. We could relax on them together.#$b#We just need to make sure no bugs decide to crawl under our clothes.$h",
	"winter_15": "On days like this I just want to sit in front of the fireplace.$h#$e#Maybe with a cozy blanket and a mug of hot chocolate.",
	"winter_20": "I thought about baking us some fresh warm cookies today.#$e#Nothing beats Evelyn's cookie recipe.$h"
}